Masmiseim36/nxpSDK/devices/MIMXRT1186/cmsis_drivers/fsl_lpuart_cmsis.c
static int32_t LPUART15_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_EdmaPowerControl(state, &LPUART15_EdmaDriverState);
}

static int32_t LPUART15_EdmaSend(const void *data, uint32_t num)
{
    return LPUART_EdmaSend(data, num, &LPUART15_EdmaDriverState);
}

static int32_t LPUART15_EdmaReceive(void *data, uint32_t num)
{
    return LPUART_EdmaReceive(data, num, &LPUART15_EdmaDriverState);
}

static int32_t LPUART15_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_EdmaTransfer(data_out, data_in, num, &LPUART15_EdmaDriverState);
}

static uint32_t LPUART15_EdmaGetTxCount(void)
{
    return LPUART_EdmaGetTxCount(&LPUART15_EdmaDriverState);
}

static uint32_t LPUART15_EdmaGetRxCount(void)
{
    return LPUART_EdmaGetRxCount(&LPUART15_EdmaDriverState);
}

static int32_t LPUART15_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_EdmaControl(control, arg, &LPUART15_EdmaDriverState);
}

static ARM_USART_STATUS LPUART15_EdmaGetStatus(void)
{
    return LPUART_EdmaGetStatus(&LPUART15_EdmaDriverState);
}

#endif

#else

static lpuart_handle_t LPUART15_Handle;

#if defined(USART15_RX_BUFFER_ENABLE) && (USART15_RX_BUFFER_ENABLE == 1)
static uint8_t lpuart15_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart15_non_blocking_driver_state")
static cmsis_lpuart_non_blocking_driver_state_t LPUART15_NonBlockingDriverState = {
#else
static cmsis_lpuart_non_blocking_driver_state_t LPUART15_NonBlockingDriverState = {
#endif
    &LPUART15_Resource,
    &LPUART15_Handle,
};

static int32_t LPUART15_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART15_PIN_INIT
    RTE_USART15_PIN_INIT();
#endif
    return LPUART_NonBlockingInitialize(cb_event, &LPUART15_NonBlockingDriverState);
}

static int32_t LPUART15_NonBlockingUninitialize(void)
{
#ifdef RTE_USART15_PIN_DEINIT
    RTE_USART15_PIN_DEINIT();
#endif
    return LPUART_NonBlockingUninitialize(&LPUART15_NonBlockingDriverState);
}

static int32_t LPUART15_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    int32_t result;

    result = LPUART_NonBlockingPowerControl(state, &LPUART15_NonBlockingDriverState);

#if defined(USART15_RX_BUFFER_ENABLE) && (USART15_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (LPUART15_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        LPUART_TransferStartRingBuffer(LPUART15_NonBlockingDriverState.resource->base,
                                       LPUART15_NonBlockingDriverState.handle, lpuart15_rxRingBuffer,
                                       USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

static int32_t LPUART15_NonBlockingSend(const void *data, uint32_t num)
{
    return LPUART_NonBlockingSend(data, num, &LPUART15_NonBlockingDriverState);
}

static int32_t LPUART15_NonBlockingReceive(void *data, uint32_t num)
{
    return LPUART_NonBlockingReceive(data, num, &LPUART15_NonBlockingDriverState);
}

static int32_t LPUART15_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_NonBlockingTransfer(data_out, data_in, num, &LPUART15_NonBlockingDriverState);
}

static uint32_t LPUART15_NonBlockingGetTxCount(void)
{
    return LPUART_NonBlockingGetTxCount(&LPUART15_NonBlockingDriverState);
}

static uint32_t LPUART15_NonBlockingGetRxCount(void)
{
    return LPUART_NonBlockingGetRxCount(&LPUART15_NonBlockingDriverState);
}

static int32_t LPUART15_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = LPUART_NonBlockingControl(control, arg, &LPUART15_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }

    /* Enable the receive interrupts if ring buffer is used */
    if (LPUART15_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        LPUART_EnableInterrupts(
            LPUART15_NonBlockingDriverState.resource->base,
            (uint32_t)kLPUART_RxDataRegFullInterruptEnable | (uint32_t)kLPUART_RxOverrunInterruptEnable);
    }

    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS LPUART15_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART15_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART15 = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities,
#if defined(RTE_USART15_DMA_EN) && RTE_USART15_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
                                   LPUART15_EdmaInitialize, LPUART15_EdmaUninitialize, LPUART15_EdmaPowerControl,
                                   LPUART15_EdmaSend,       LPUART15_EdmaReceive,      LPUART15_EdmaTransfer,
                                   LPUART15_EdmaGetTxCount, LPUART15_EdmaGetRxCount,   LPUART15_EdmaControl,
                                   LPUART15_EdmaGetStatus,
#else
                                   LPUART15_DmaInitialize,  LPUART15_DmaUninitialize, LPUART15_DmaPowerControl,
                                   LPUART15_DmaSend,        LPUART15_DmaReceive,      LPUART15_DmaTransfer,
                                   LPUART15_DmaGetTxCount,  LPUART15_DmaGetRxCount,   LPUART15_DmaControl,
                                   LPUART15_DmaGetStatus,
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */
#else
                                  LPUART15_NonBlockingInitialize,
                                  LPUART15_NonBlockingUninitialize,
                                  LPUART15_NonBlockingPowerControl,
                                  LPUART15_NonBlockingSend,
                                  LPUART15_NonBlockingReceive,
                                  LPUART15_NonBlockingTransfer,
                                  LPUART15_NonBlockingGetTxCount,
                                  LPUART15_NonBlockingGetRxCount,
                                  LPUART15_NonBlockingControl,
                                  LPUART15_NonBlockingGetStatus,
#endif /* RTE_USART15_DMA_EN */
                                   LPUARTx_SetModemControl, LPUARTx_GetModemStatus};

