Masmiseim36/nxpSDK/devices/MIMXRT1186/cmsis_drivers/fsl_lpuart_cmsis.c
#endif /* LPUART19 */

#if (defined(LPUART20) || defined(LPUART_20)) && defined(RTE_USART20) && RTE_USART20

/* User needs to provide the implementation for LPUART20_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPUART20_GetFreq(void);

#if defined(LPUART20)
static cmsis_lpuart_resource_t LPUART20_Resource = {LPUART20, LPUART20_GetFreq};
#elif defined(LPUART_20)
static cmsis_lpuart_resource_t LPUART20_Resource = {LPUART_20, LPUART20_GetFreq};
#endif

#if defined(RTE_USART20_DMA_EN) && RTE_USART20_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_lpuart_dma_resource_t LPUART20_DmaResource = {
    RTE_USART20_DMA_TX_DMA_BASE,    RTE_USART20_DMA_TX_CH,          RTE_USART20_DMA_TX_PERI_SEL,
    RTE_USART20_DMA_RX_DMA_BASE,    RTE_USART20_DMA_RX_CH,          RTE_USART20_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART20_DMA_TX_DMAMUX_BASE, RTE_USART20_DMA_RX_DMAMUX_BASE,
#endif
#if FSL_FEATURE_DMA_MODULE_CHANNEL != FSL_FEATURE_DMAMUX_MODULE_CHANNEL
    RTE_USART20_DMAMUX_TX_CH,       RTE_USART20_DMAMUX_RX_CH
#endif
};

static lpuart_dma_handle_t LPUART20_DmaHandle;
static dma_handle_t LPUART20_DmaRxHandle;
static dma_handle_t LPUART20_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart20_dma_driver_state")
static cmsis_lpuart_dma_driver_state_t LPUART20_DmaDriverState = {
#else
static cmsis_lpuart_dma_driver_state_t LPUART20_DmaDriverState = {
#endif
    &LPUART20_Resource, &LPUART20_DmaResource, &LPUART20_DmaHandle, &LPUART20_DmaRxHandle, &LPUART20_DmaTxHandle,
};

static int32_t LPUART20_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART20_PIN_INIT
    RTE_USART20_PIN_INIT();
#endif
    return LPUART_DmaInitialize(cb_event, &LPUART20_DmaDriverState);
}

static int32_t LPUART20_DmaUninitialize(void)
{
#ifdef RTE_USART20_PIN_DEINIT
    RTE_USART20_PIN_DEINIT();
#endif
    return LPUART_DmaUninitialize(&LPUART20_DmaDriverState);
}

static int32_t LPUART20_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_DmaPowerControl(state, &LPUART20_DmaDriverState);
}

static int32_t LPUART20_DmaSend(const void *data, uint32_t num)
{
    return LPUART_DmaSend(data, num, &LPUART20_DmaDriverState);
}

static int32_t LPUART20_DmaReceive(void *data, uint32_t num)
{
    return LPUART_DmaReceive(data, num, &LPUART20_DmaDriverState);
}

static int32_t LPUART20_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_DmaTransfer(data_out, data_in, num, &LPUART20_DmaDriverState);
}

static uint32_t LPUART20_DmaGetTxCount(void)
{
    return LPUART_DmaGetTxCount(&LPUART20_DmaDriverState);
}

static uint32_t LPUART20_DmaGetRxCount(void)
{
    return LPUART_DmaGetRxCount(&LPUART20_DmaDriverState);
}

static int32_t LPUART20_DmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_DmaControl(control, arg, &LPUART20_DmaDriverState);
}

static ARM_USART_STATUS LPUART20_DmaGetStatus(void)
{
    return LPUART_DmaGetStatus(&LPUART20_DmaDriverState);
}

/* LPUART20 Driver Control Block */

#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

static cmsis_lpuart_edma_resource_t LPUART20_EdmaResource = {
    RTE_USART20_DMA_TX_DMA_BASE,    RTE_USART20_DMA_TX_CH,          RTE_USART20_DMA_TX_PERI_SEL,
    RTE_USART20_DMA_RX_DMA_BASE,    RTE_USART20_DMA_RX_CH,          RTE_USART20_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART20_DMA_TX_DMAMUX_BASE, RTE_USART20_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static lpuart_edma_handle_t LPUART20_EdmaHandle);
static edma_handle_t LPUART20_EdmaRxHandle;
static edma_handle_t LPUART20_EdmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart20_edma_driver_state")
static cmsis_lpuart_edma_driver_state_t LPUART20_EdmaDriverState = {
#else
static cmsis_lpuart_edma_driver_state_t LPUART20_EdmaDriverState = {
#endif
    &LPUART20_Resource, &LPUART20_EdmaResource, &LPUART20_EdmaHandle, &LPUART20_EdmaRxHandle, &LPUART20_EdmaTxHandle,
};

static int32_t LPUART20_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART20_PIN_INIT
    RTE_USART20_PIN_INIT();
#endif
    return LPUART_EdmaInitialize(cb_event, &LPUART20_EdmaDriverState);
}

static int32_t LPUART20_EdmaUninitialize(void)
{
#ifdef RTE_USART20_PIN_DEINIT
    RTE_USART20_PIN_DEINIT();
#endif
    return LPUART_EdmaUninitialize(&LPUART20_EdmaDriverState);
}

static int32_t LPUART20_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_EdmaPowerControl(state, &LPUART20_EdmaDriverState);
}

static int32_t LPUART20_EdmaSend(const void *data, uint32_t num)
{
    return LPUART_EdmaSend(data, num, &LPUART20_EdmaDriverState);
}

static int32_t LPUART20_EdmaReceive(void *data, uint32_t num)
{
    return LPUART_EdmaReceive(data, num, &LPUART20_EdmaDriverState);
}

static int32_t LPUART20_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_EdmaTransfer(data_out, data_in, num, &LPUART20_EdmaDriverState);
}

static uint32_t LPUART20_EdmaGetTxCount(void)
{
    return LPUART_EdmaGetTxCount(&LPUART20_EdmaDriverState);
}

static uint32_t LPUART20_EdmaGetRxCount(void)
{
    return LPUART_EdmaGetRxCount(&LPUART20_EdmaDriverState);
}

static int32_t LPUART20_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_EdmaControl(control, arg, &LPUART20_EdmaDriverState);
}

static ARM_USART_STATUS LPUART20_EdmaGetStatus(void)
{
    return LPUART_EdmaGetStatus(&LPUART20_EdmaDriverState);
}

#endif

#else

static lpuart_handle_t LPUART20_Handle;

#if defined(USART20_RX_BUFFER_ENABLE) && (USART20_RX_BUFFER_ENABLE == 1)
static uint8_t lpuart20_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart20_non_blocking_driver_state")
static cmsis_lpuart_non_blocking_driver_state_t LPUART20_NonBlockingDriverState = {
#else
static cmsis_lpuart_non_blocking_driver_state_t LPUART20_NonBlockingDriverState = {
#endif
    &LPUART20_Resource,
    &LPUART20_Handle,
};

static int32_t LPUART20_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART20_PIN_INIT
    RTE_USART20_PIN_INIT();
#endif
    return LPUART_NonBlockingInitialize(cb_event, &LPUART20_NonBlockingDriverState);
}

static int32_t LPUART20_NonBlockingUninitialize(void)
{
#ifdef RTE_USART20_PIN_DEINIT
    RTE_USART20_PIN_DEINIT();
#endif
    return LPUART_NonBlockingUninitialize(&LPUART20_NonBlockingDriverState);
}

static int32_t LPUART20_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    int32_t result;

